{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "Asset_Direct",
			"Children": [
				{
					"Source":
					{
						"Text": "This is a text literal asigned directly in TextBlock's Text property."
					},
					"Translation":
					{
						"Text": "This is a text literal asigned directly in TextBlock's Text property."
					},
					"Key": "text_literal_asset_1"
				}
			]
		},
		{
			"Namespace": "Cpp_Namespace_1",
			"Children": [
				{
					"Source":
					{
						"Text": "This is the first text literal created in code."
					},
					"Translation":
					{
						"Text": "This is the first text literal created in code."
					},
					"Key": "Cpp_TextLiteral_1"
				}
			]
		},
		{
			"Namespace": "Cpp_Namespace_2",
			"Children": [
				{
					"Source":
					{
						"Text": "This is the second text literal created in code."
					},
					"Translation":
					{
						"Text": "This is the second text literal created in code."
					},
					"Key": "Cpp_TextLiteral_2"
				}
			]
		},
		{
			"Namespace": "ST_Animals",
			"Children": [
				{
					"Source":
					{
						"Text": "cat"
					},
					"Translation":
					{
						"Text": "cat"
					},
					"Key": "st_cpp_animals_cat"
				},
				{
					"Source":
					{
						"Text": "dog"
					},
					"Translation":
					{
						"Text": "dog"
					},
					"Key": "st_cpp_animals_dog"
				}
			]
		},
		{
			"Namespace": "ST_Fruits",
			"Children": [
				{
					"Source":
					{
						"Text": "apple"
					},
					"Translation":
					{
						"Text": "apple"
					},
					"Key": "st_aset_fruits_apple"
				},
				{
					"Source":
					{
						"Text": "banana"
					},
					"Translation":
					{
						"Text": "banana"
					},
					"Key": "st_asset_fruits_banana"
				},
				{
					"Source":
					{
						"Text": "strawberry"
					},
					"Translation":
					{
						"Text": "strawberry"
					},
					"Key": "st_assets_fruits_strawberry"
				}
			]
		},
		{
			"Namespace": "ST_TextLocalization_Menu",
			"Children": [
				{
					"Source":
					{
						"Text": "Below you can find some examples of different ways of setting up a localizable text. Each example has additional information written in yellowish color explaining its setup."
					},
					"Translation":
					{
						"Text": "Below you can find some examples of different ways of setting up a localizable text. Each example has additional information written in yellowish color explaining its setup."
					},
					"Key": "introduction_info"
				},
				{
					"Source":
					{
						"Text": "Bonus - non-localized text examples:"
					},
					"Translation":
					{
						"Text": "Bonus - non-localized text examples:"
					},
					"Key": "section_title_missing_localization"
				},
				{
					"Source":
					{
						"Text": "Creating text literals directly in an asset by using FText property."
					},
					"Translation":
					{
						"Text": "Creating text literals directly in an asset by using FText property."
					},
					"Key": "asset_localized_text"
				},
				{
					"Source":
					{
						"Text": "Creating text literals in C++ by using the LOCTEXT macros."
					},
					"Translation":
					{
						"Text": "Creating text literals in C++ by using the LOCTEXT macros."
					},
					"Key": "cpp_loc_macro"
				},
				{
					"Source":
					{
						"Text": "Dynamically assigning a text from a String Table created in C++."
					},
					"Translation":
					{
						"Text": "Dynamically assigning a text from a String Table created in C++."
					},
					"Key": "cpp_string_table_dynamic_load"
				},
				{
					"Source":
					{
						"Text": "Linking texts from a String Table created as uasset."
					},
					"Translation":
					{
						"Text": "Linking texts from a String Table created as uasset."
					},
					"Key": "asset_string_table"
				},
				{
					"Source":
					{
						"Text": "Linking texts from a String Table created in C++ from data loaded from a CSV file."
					},
					"Translation":
					{
						"Text": "Linking texts from a String Table created in C++ from data loaded from a CSV file."
					},
					"Key": "cpp_string_table_from_csv"
				},
				{
					"Source":
					{
						"Text": "Linking texts from a String Table created in C++ using LOCTABLE macros."
					},
					"Translation":
					{
						"Text": "Linking texts from a String Table created in C++ using LOCTABLE macros."
					},
					"Key": "cpp_string_table_from_loc_macro"
				},
				{
					"Source":
					{
						"Text": "Missing text localization - it always falls back to the native language."
					},
					"Translation":
					{
						"Text": "Missing text localization - it always falls back to the native language."
					},
					"Key": "missing_localization_text"
				},
				{
					"Source":
					{
						"Text": "Text Localization"
					},
					"Translation":
					{
						"Text": "Text Localization"
					},
					"Key": "title_text_localization"
				},
				{
					"Source":
					{
						"Text": "Using String Tables:"
					},
					"Translation":
					{
						"Text": "Using String Tables:"
					},
					"Key": "section_title_string_tables"
				},
				{
					"Source":
					{
						"Text": "Using Text Literals:"
					},
					"Translation":
					{
						"Text": "Using Text Literals:"
					},
					"Key": "section_title_text_literals"
				},
				{
					"Source":
					{
						"Text": "Using non-localized text."
					},
					"Translation":
					{
						"Text": "Using non-localized text."
					},
					"Key": "non_localized_text"
				}
			]
		},
		{
			"Namespace": "ST_Weapons",
			"Children": [
				{
					"Source":
					{
						"Text": "axe"
					},
					"Translation":
					{
						"Text": "axe"
					},
					"Key": "st_cpp_weapons_axe"
				},
				{
					"Source":
					{
						"Text": "bow"
					},
					"Translation":
					{
						"Text": "bow"
					},
					"Key": "st_cpp_weapons_bow"
				},
				{
					"Source":
					{
						"Text": "sword"
					},
					"Translation":
					{
						"Text": "sword"
					},
					"Key": "st_cpp_weapons_sword"
				}
			]
		}
	]
}